src/Documents/ОплатаЗаказаКлиентом/ОплатаЗаказаКлиентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаЗаказаКлиентом</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ТипСумма</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияДенежныхСредств</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ТипСумма</types>
    </type>
  </resources>
  <dimensions>
    <name>НаправлениеДвижения</name>
    <type>
      <types>EnumRef.НаправленияДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/НаправленияДвиженияДенежныхСредств/НаправленияДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияДвиженияДенежныхСредств</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Оплата</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ОплатаЗаказаКлиентом/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатаЗаказаКлиентом.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.НаправленияДвиженияДенежныхСредств.Поступление) КАК НаправлениеДвижения,
	|	ОплатаЗаказаКлиентом.БанковскийСчет КАК БанковскийСчет,
	|	ОплатаЗаказаКлиентом.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	СУММА(ОплатаЗаказаКлиентом.Сумма) КАК Сумма
	|ИЗ
	|	Документ.ОплатаЗаказаКлиентом КАК ОплатаЗаказаКлиентом
	|ГДЕ
	|	ОплатаЗаказаКлиентом.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатаЗаказаКлиентом.СтатьяДвиженияДенежныхСредств,
	|	ОплатаЗаказаКлиентом.БанковскийСчет,
	|	ОплатаЗаказаКлиентом.Дата";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	
	Движения.ДвиженияДенежныхСредств.Загрузить(ТаблицаЗапроса);
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Заказ = ДанныеЗаполнения.Ссылка;
		Сумма = ДанныеЗаполнения.Товары.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры
